#+FILETAGS:WORK
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+COLUMNS: %40ITEM(Task) %17Effort(Estimated Effort){:} %CLOCKSUM

* TODO MATH                                                               :MATH:
  :PROPERTIES:
  :ID:       834d2d31-aa5e-49d3-ba47-089e1916949b
  :END:
   [2018-02-04 Sun 10:23]


** TODO content of my animation
:LOGBOOK:
CLOCK: [2019-10-20 Sun 17:03]--[2019-10-20 Sun 17:06] =>  0:03
:END:
 Added:<2019-10-20 Sun 17:03>

 信息科学：
1. 信号与系统
2. 数字信号处理
3. 信息论
4. 信道编码（差错控制编码）
5. 通信理论
6. 自动控制理论
7. 数值计算
8. 电磁场与电磁波

数学：
1. 微积分
2. 工程数学
3. 线性代数和抽象数学
4. 概率
5. 随机过程
6. 偏微分方程
7. 图论

计算机科学：
1. 算法导论
2. 离散数学
3. 计算机体系结构
4. 神经网络人工智能
5. 数据结构
6. 计算机网络
7. python
8. 操作系统
9. 计算机视觉
10. 具体数学里有很多有意思的例子

 操作系统+计算机网络+数据库 + 算法 这四个课程是 ICT 行业的基础，万变不离其宗。

技术：
1. ToF

STEM in life 背后的数学问题：
1. 孔明锁
2. 七巧板
3. 九连环
4. 魔方

关于视频内容，我准备分两步：
1. 录制当前课程中的一些经典主题内容，主要是为了吸引观众，就像 3blue1brown 做的那
   样
2. 关于计算机科学可以尝试把就打经典算法可视化。我觉得这可能会带来比较多的乐趣。
3. 通信理论中也有不少比较漂亮的算法

另外我还可以专门针对某一本书籍进行专项的视频制作。我的目的是：让复杂的算法可视化，
让抽象的感念可视化。

MIT 的 OCW 主页上统计了访问频率最高的一些课程，如下：

| MIT COURSE# | COURSE TITLE                                                             |
| 6.0001      | Introduction to Computer Science and Programming in Python               |
| 18.06       | Linear Algebra                                                           |
| 6.006       | Introduction to Algorithms                                               |
| 18.01SC     | Single Variable Calculus                                                 |
| 18.06SC     | Linear Algebra                                                           |
| 6.00SC      | Introduction to Computer Science and Programming                         |
| 6.042J      | Mathematics for Computer Science                                         |
| 6.034       | Artificial Intelligence                                                  |
| 18.02SC     | Multivariable Calculus                                                   |
| 18.01       | Single Variable Calculus                                                 |
| 6.0002      | Introduction to Computational Thinking and Data Science                  |
| 8.01SC      | Classical Mechanics                                                      |
| 18.05       | Introduction to Probability and Statistics                               |
| 18.065      | Matrix Methods in Data Analysis, Signal Processing, and Machine Learning |
| 18.02       | Multivariable Calculus                                                   |
| 6.042J      | Mathematics for Computer Science                                         |
| 14.01SC     | Principles of Microeconomics                                             |
| 18.S096     | Topics in Mathematics with Applications in Finance                       |
| 6.046J      | Design and Analysis of Algorithms                                        |
| 6.002       | Circuits and Electronics                                                 |

所有的课程都是本科生的，所以我的视频受众最好也不要定的太高端。
** TODO Euclid's Elementary
:LOGBOOK:
CLOCK: [2019-10-06 Sun 22:44]--[2019-10-06 Sun 23:33] =>  0:49
:END:
Added:<2019-10-06 Sun 22:44>

欧几里德的几何原本，适合用来练手 manim
* TODO COMMUNICATION                                             :COMMUNICATION:
  :PROPERTIES:
  :ID:       9c6fca84-1b15-46f2-86e5-09e7e2e1a28e
  :END:
  [2018-02-04 Sun 10:23]

信号与系统材料：
[[file:///Users/chaolongzhang/Documents/signal_and_system/][signal_and_system]]


* TODO COMPUTER                                                       :COMPUTER:
  :PROPERTIES:
  :ID:       ca37c183-7418-4534-abf1-ad7fff3a87aa
  :END:
  [2018-02-04 Sun 10:23]

* TODO SCIENCE                                                         :SCIENCE:
  1. 费曼物理学讲义
  2. 朗道物理
  3. 《Mathematical methods for Physics and engineering》by Riley
  4. 《All the Mathematics you missed but need to know》by Garrity
  5. 《Classical Mechanics- Systems of Particles and Hamiltonian Dynamics》by Greiner
  6. 伯克利物理学系列
  7. 《Introduction to Electrodynamics》及《习题解答》by Griffiths
  8. 《Classical Electrodynamics》及《习题解答》by Jackson
  9. 《An Introduction to Thermal physics》by Schroeder

  and the following links give excellent answers about the science and math textbooks:
  https://www.zhihu.com/question/62795154/answer/234744948
  https://www.zhihu.com/question/21451715/answer/429838579


** TODO Physics from berkley
[2019-10-22 Tue 23:04]
* TODO TOOLS                                                              :TOOL:
  :PROPERTIES:
  :ID:       01c39ce7-b0d1-4406-a859-996de01cbe82
  :END:
  [2018-02-04 Sun 10:23]


** NEXT 从 ox-hugo 到 hugo academic
 Added:<2019-11-27 Wed 22:15>

[[file:~/Dropbox/zorg/Journal/20191006::*%E6%89%93%E9%80%9A%E4%BB%8E%20ox-hugo%20%E5%88%B0%20hugo][打通从 ox-hugo 到 hugo]]

** TODO resolve conflicts using magit in Emacs
 Added:<2019-10-20 Sun 17:23>

https://magit.vc/manual/magit/Resolving-Conflicts.html

** TODO git with Emacs: magit
 Added:<2019-10-09 Wed 22:09>

和 Emacs 结合要用一些比较常用的工具作为切入点。避免直接介绍，除非有这个时间。
** TODO ox-hugo export custom links
:LOGBOOK:
CLOCK: [2019-12-08 Sun 08:05]--[2019-12-08 Sun 08:19] =>  0:14
:END:
 Added:<2019-12-08 Sun 08:05>

如果要定制一个链接需要在 front matter 中添加如下的设置。

#+begin_src toml :front_matter_extra t
[[links]]
  name = 1
  url = "abc"
  icon = "twitter"
  icon_pack = "fab"
  name = "Follow"
  url = "https://twitter.com/georgecushen"
#+end_src
** DONE hugo academic tag post
CLOSED: [2019-12-15 Sun 23:19]
:LOGBOOK:
- CLOSING NOTE [2019-12-15 Sun 23:19] \\
  done by delete the tag in the msc_posts.md and msc_videos.md
:END:
[2019-12-11 Wed 17:51]

使用 showcase 里的一个配置。
* MISC
  :PROPERTIES:
  :ID:       fe556f0a-eeee-418a-b5f8-f10b82884f4f
  :END:
  Added:[2016-01-05 Tue 21:56]

** NEXT flyspell and english writing
:LOGBOOK:
CLOCK: [2019-10-06 Sun 23:33]--[2019-10-06 Sun 23:34] =>  0:01
:END:
 Added:<2019-10-06 Sun 23:33>

powerthesaurus 是一个根据你输入的单词查询同义词的词典，而 emacs-powerthesaurus 是
Emacs 对该网站的一个接口。

这个插件提供了三个命令。
